In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [6]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [7]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [8]:
# Access column 
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [9]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [11]:
df[['Make', 'Model', 'MSRP']]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [18]:
np.linspace(1,5,5)

array([1., 2., 3., 4., 5.])

In [21]:
df['id'] = np.array(np.linspace(1,5,5) * 10)

In [22]:
df.head()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,10.0
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20.0
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,40.0
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50.0

In [23]:
df.index

RangeIndex(start=0, stop=5, step=1)

## Access Ops

In [24]:
df.MSRP

0     2000
1    27150
2    54990
3    34450
4    32340
Name: MSRP, dtype: int64

In [25]:
df.loc[1]

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
id                        20.0
Name: 1, dtype: object

In [26]:
df.loc[[3, 4]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,40.0
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50.0

In [27]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [28]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,10.0
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20.0
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,40.0
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50.0

In [31]:
df.loc[['b', 'c']]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20.0
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0

In [32]:
df.iloc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20.0
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0

In [33]:
df.reset_index()

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,10.0
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20.0
2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,40.0
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50.0

In [34]:
df.reset_index(drop=True)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,10.0
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,20.0
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,40.0
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50.0

## Element wise ops

In [36]:
df['Engine HP'] / 100

a    1.38
b     NaN
c    2.18
d    1.94
e    2.61
Name: Engine HP, dtype: float64

In [37]:
# Series is a wrapper on numpy arrays

In [38]:
df['Year'] >= 2015

a    False
b     True
c    False
d     True
e     True
Name: Year, dtype: bool

In [44]:
# Filtering
df[
    (df['Year'] >= 2015) & (df['Make'] == 'Nissan')
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,50.0

## String ops

In [46]:
df['Vehicle_Style']

a          sedan
b          Sedan
c    convertible
d        4dr SUV
e         Pickup
Name: Vehicle_Style, dtype: object

In [47]:
'STR'.lower()

'str'

In [48]:
df['Vehicle_Style'].str.lower()

a          sedan
b          sedan
c    convertible
d        4dr suv
e         pickup
Name: Vehicle_Style, dtype: object

In [50]:
'machine learning course'.replace(' ', '_')

'machine_learning_course'

In [53]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.lower().str.replace(' ', '_')
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,10.0
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150,20.0
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,30.0
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450,40.0
e,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340,50.0

## Summarizing ops

In [55]:
df.MSRP.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [57]:
df.describe().round(2)

          Year  Engine HP  Engine Cylinders      MSRP     id
count     5.00       4.00              5.00      5.00   5.00
mean   2010.40     202.75              4.40  30186.00  30.00
std      11.26      51.30              0.89  18985.04  15.81
min    1991.00     138.00              4.00   2000.00  10.00
25%    2010.00     180.00              4.00  27150.00  20.00
50%    2017.00     206.00              4.00  32340.00  30.00
75%    2017.00     228.75              4.00  34450.00  40.00
max    2017.00     261.00              6.00  54990.00  50.00

In [61]:
df.Make.nunique()

4

In [62]:
df.Make.unique()

array(['Nissan', 'Hyundai', 'Lotus', 'GMC'], dtype=object)

In [66]:
df.nunique()

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
MSRP                 5
id                   5
dtype: int64

In [67]:
## Missing values

In [68]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,False,False,False,False,False,False,False,False,False
b,False,False,False,True,False,False,False,False,False
c,False,False,False,False,False,False,False,False,False
d,False,False,False,False,False,False,False,False,False
e,False,False,False,False,False,False,False,False,False

In [69]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
id                   0
dtype: int64

## Grouping

```
SELECT 
    transmission_type,
    AVG(MSRP)
FROM
    cars_data
GROUP BY
    transmission_type
```

In [77]:
df.groupby('Transmission Type')['MSRP'].mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

In [78]:
df.groupby('Transmission Type').aggregate({'MSRP': 'mean'})

                           MSRP
Transmission Type
AUTOMATIC          30800.000000
MANUAL             29776.666667

In [80]:
df.MSRP.values

array([ 2000, 27150, 54990, 34450, 32340])

In [83]:
df.to_dict(orient='records')

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000,
  'id': 10.0},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'sedan',
  'MSRP': 27150,
  'id': 20.0},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990,
  'id': 30.0},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450,
  'id': 40.0},
 {'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'pickup',
  'MSRP': 32340,
  'id': 50.0}]